Function.prototype.getMultiLine = function () {
        var lines = new String(this);
        lines = lines.substring(lines.indexOf("/*") + 3, lines.lastIndexOf("*/"));
        return lines;
    }

var string = function () {
	/*
	__________ .__                    __    .__             .__            __________                      __                   __   ._.
	\______   \|  |  _____     ____  |  | __|  |__    ____  |  |    ____   \______   \_______   ____      |__|  ____    ____  _/  |_ | |
	 |    |  _/|  |  \__  \  _/ ___\ |  |/ /|  |  \  /  _ \ |  |  _/ __ \   |     ___/\_  __ \ /  _ \     |  |_/ __ \ _/ ___\ \   __\| |
	 |    |   \|  |__ / __ \_\  \___ |    < |   Y  \(  <_> )|  |__\  ___/   |    |     |  | \/(  <_> )    |  |\  ___/ \  \___  |  |   \|
	 |______  /|____/(____  / \___  >|__|_ \|___|  / \____/ |____/ \___  >  |____|     |__|    \____/ /\__|  | \___  > \___  > |__|   __
			\/            \/      \/      \/     \/                    \/                             \______|     \/      \/         \/
	啊呀，被发现了。既然这样，我就告诉你 BlackCB 是位巨佬吧 = =
	*/
    }
window.console.log(string.getMultiLine());